app/views/enrolments/_form.html.erb


      <%= f.grouped_collection_select :course_id, CourseCategory.all, :courses, :title, :id, :name, :include_blank => 'Please Select' %>
---
SELECT `courses`.* FROM `courses`