app/controllers/admin/forms_controller.rb

	def index
    @forms = Form.all
---
SELECT `forms`.* FROM `forms`

  def create
    @form = Form.new(form_params)

    if @form.save
---
INSERT INTO `forms` (`form_name`, `description`, `created_at`, `updated_at`) VALUES ('form one', 'first question test\r\n', '2015-05-10 10:07:15.648602', '2015-05-10 10:07:15.648602')

		def set_form
			@form = Form.find(params[:id])
---
SELECT  `forms`.* FROM `forms` WHERE `forms`.`id` = 4 LIMIT 1