app/controllers/admin/questions_controller.rb

INSERT INTO `questions` (`title`, `content`, `created_at`, `updated_at`) VALUES ('question 1', 'what is ur name\r\n', '2015-05-10 10:26:51.843869', '2015-05-10 10:26:51.843869')
---
  def create
    @question = Question.new(question_params)

    if @question.save

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
    def set_question
      @question = Question.find(params[:id])