app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT `addresses`.* FROM `addresses`

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
---
INSERT INTO `addresses` (`property_name`, `street1`, `street2`, `suburb`, `postcode`, `state`, `country`, `created_at`, `updated_at`) VALUES ('', '155-161 Boundary RD', 'North Melbourne', 'MELBOURNE', '3051', 'Victoria', 'Australia', '2015-05-11 02:11:54.087677', '2015-05-11 02:11:54.087677')

    def set_address
      @address = Address.find(params[:id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 2 LIMIT 1