app/controllers/course_categories_controller.rb

SELECT `course_categories`.* FROM `course_categories`
---
  def index
    @course_categories = CourseCategory.all

INSERT INTO `course_categories` (`title`, `content`, `created_at`, `updated_at`) VALUES ('Business', 'Business Courses', '2015-05-10 23:26:22.531421', '2015-05-10 23:26:22.531421')
---
  def create
    @course_category = CourseCategory.new(course_category_params)

    respond_to do |format|
      if @course_category.save

SELECT  `course_categories`.* FROM `course_categories` WHERE `course_categories`.`id` = 1 LIMIT 1
---
    def set_course_category
      @course_category = CourseCategory.find(params[:id])