app/controllers/courses_controller.rb

INSERT INTO `courses` (`name`, `code`, `fee_for_service`, `vet_fee`, `gov_funded`, `concession_gov_funded`, `material_cost`, `transfer_fee`, `delivery_mode`, `location_of_delivery`, `study_duration`, `created_at`, `updated_at`) VALUES ('Certificate III in Business', 'BSB30112', 1231, 1, 1, 1, 1, 1, '', '', '24 week', '2015-05-10 23:39:18.568581', '2015-05-10 23:39:18.568581')
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE `courses` SET `delivery_mode` = 'classroom, distance', `updated_at` = '2015-05-11 09:45:58.650196' WHERE `courses`.`id` = 1
---
  def update
    respond_to do |format|
      if @course.update(course_params)

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
    def set_course
      @course = Course.find(params[:id])