app/controllers/enrolments_controller.rb

  def index
    @enrolments = Enrolment.all
---
SELECT `enrolments`.* FROM `enrolments`

  def create
    @enrolment = Enrolment.new(enrolment_params)

    respond_to do |format|
      if @enrolment.save
---
INSERT INTO `enrolments` (`delivery_mode`, `completed_qualification`, `qualification_received_location`, `vet`, `toc`, `student_id`, `address_id`, `employment_id`, `employer_id`, `emergency_contact_id`, `school_id`, `language_culture_diversity_id`, `emergency_contact1_id`, `created_at`, `updated_at`) VALUES ('', '', '', '1', '1', 6, 6, 1, 4, 2, 1, 1, 3, '2015-05-11 09:17:34.562934', '2015-05-11 09:17:34.562934')

  def update
    respond_to do |format|
      if @enrolment.update(enrolment_params)
---
UPDATE `enrolments` SET `completed_qualification` = 'ad', `qualification_received_location` = 'ad', `emergency_contact_id` = 6, `emergency_contact1_id` = 7, `language_culture_diversity_id` = 3, `school_id` = 3, `employment_id` = 3, `vic_student_id` = 1, `updated_at` = '2015-05-11 09:21:19.734119' WHERE `enrolments`.`id` = 6

    def set_enrolment
      @enrolment = Enrolment.find(params[:id])
---
SELECT  `enrolments`.* FROM `enrolments` WHERE `enrolments`.`id` = 1 LIMIT 1