app/controllers/pre_training_reviews_controller.rb

SELECT `pre_training_reviews`.* FROM `pre_training_reviews`
---
  def index
    @pre_training_reviews = PreTrainingReview.all

INSERT INTO `pre_training_reviews` (`rpl`, `credit_transfer`, `area_of_work`, `employment`, `pathway`, `preferred_learning_style`, `delivery_mode`, `speical_condition`, `toc`, `created_at`, `updated_at`) VALUES ('test1', 'a', 'adsfa', 'adf', 'asdfa', '1', 'Distance', 'adsf', 1, '2015-05-10 13:24:57.716911', '2015-05-10 13:24:57.716911')
---
  def create
    @pre_training_review = PreTrainingReview.new(pre_training_review_params)

    respond_to do |format|
      if @pre_training_review.save

UPDATE `pre_training_reviews` SET `preferred_learning_style` = '0', `updated_at` = '2015-05-10 13:25:49.152994' WHERE `pre_training_reviews`.`id` = 1
---
  def update
    respond_to do |format|
      if @pre_training_review.update(pre_training_review_params)

SELECT  `pre_training_reviews`.* FROM `pre_training_reviews` WHERE `pre_training_reviews`.`id` = 1 LIMIT 1
---
    def set_pre_training_review
      @pre_training_review = PreTrainingReview.find(params[:id])